import "./About_Us.css";

function About_Us() {
  return (
    <div className="About_Us_Container">
      <h1>من نحن؟</h1>
      <p>
        نحن نقدم لكم أفضل الخدمات نحن نقدم لكم أفضل الخدمات نحن نقدم لكم أفضل
        الخدماتنحن نقدم لكم أفضل الخدمات
      </p>
      <h1>من نحن؟</h1>
      <p>
        نحن نقدم لكم أفضل الخدمات نحن نقدم لكم أفضل الخدمات نحن نقدم لكم أفضل
        الخدماتنحن نقدم لكم أفضل الخدمات
      </p>
      <h1>من نحن؟</h1>
      <p>
        نحن نقدم لكم أفضل الخدمات نحن نقدم لكم أفضل الخدمات نحن نقدم لكم أفضل
        الخدماتنحن نقدم لكم أفضل الخدمات
      </p>
    </div>
  );
}

export default About_Us;
