import Masjid from "../assets/Masjid.jpg";
import Masjid2 from "../assets/Masjid2.jpg";
import City from "../assets/City.jpg";
import City2 from "../assets/City2.jpg";
import Sahara from "../assets/Sahara.jpg";
import Sahara2 from "../assets/Sahara2.jpg";
import All_Destinations from "./All_Destinations";

import "./Destination.css";

const Destination = () => {
  return (
    <div className="Destinations">
      <h1>مختلف الوجهات</h1>
      <p>Destination</p>
      <All_Destinations
        className="Destination_Item"
        Img1={Masjid}
        Img2={Masjid2}
        Title="المساجد"
        Text="تحتوي الجزائر على العديد من المساجد والجوامع الإسلامية التي تتميز بالزخارف وفن العمارة المميزة ومن أهمها ما يلي:
        جامع كتشاوة: مسجد تاريخي موجود في عاصمة الجزائر، بُني المسجد في فترة الحكم العثماني في 1612 ميلادي وتمت توسعته لاحقاً على يد الباي حسن في العام 1792 ميلادي، أثناء الحكم الفرنسي للجزائر تحوّل هذا المسجد إلى كاتدرائية القديس فيليب، التي ظلت كذلك حتى عام 1962 ميلادي، وعندها تمت إعادة المسجد إلى وضعه الأصلي، وعلى الرغم من هذه التحولات فقد احتفظ المسجد بعظمته الأصلية وعراقته التاريخية، كما تم تسجيل المسجد في قائمة اليونسكو للتراث العالمي في عام 1992، كجزء من آثار مدينة الجزائر.
        المسجد الكبير :مسجد حسن باشا أو مسجد الباشا كما اشتهر باسم المسجد الكبير، بُني المسجد في عام 1796 م في مدينة وهران الجزائرية، في عهد حكم الباي محمد بن عثمان الكبير عندما أمره بابا حسن باشا بتشيده وذلك خلال الفترة العثمانية من القرن الثامن عشر.
        مسجد المنصورة :هو مسجد تاريخي مهدم يقع في مدينة المنصورة شمال غرب الجزائر في ولاية تلمسان، بُني المسجد في عهد بنو مرين في عام 1303 ميلادي وذلك على يد السلطان أبي يعقوب يوسف الناصر، وتمت زخرفة البوابة الرئيسية لاحقاً في عهد السلطان أبي الحسن المريني في عام 1336.
        الجامع الكبير في تلمسان : يُعتبر أحد أقدم وأهم المساجد التاريخية الموجودة في مدينة تلمسان في الجزائر، بُني في عهد السلطان يوسف بن تاشفين في عام 1082 ميلادي ومن ثم أُعيد بناؤه في عهد ابنه علي بن يوسف في عام 1136 ميلادي، ويعتبر أحد أفضل الأمثلة عن العمارة المرابطية."
      />

      <All_Destinations
        className="Destination_Item_Reverse"
        Img1={City}
        Img2={City2}
        Title="المدن"
        Text="تُعد الجزائر من الدول القليلة التي تمتلك مقومات هائلة في قطاع السياحة تجعلها إحدى الوجهات المفضلة للسياح حول العالم، فهناك العديد من الأماكن والمدن التي يمكن أن تقضي فيها عطلتك السنوية الصيفية في الجزائر، تمزج هذه المدن بين سحر الطبيعة الخلابة ورمال الشواطئ الذهبية وزرقة البحر والمعالم التاريخية الأثرية السياحية، التي تعكس تزاوجاً بين الطبيعة والتاريخ والبر والبحر، "
      />

      <All_Destinations
        className="Destination_Item"
        Img1={Sahara}
        Img2={Sahara2}
        Title="الصحراء"
        Text="تعد الصحراء الجزائرية ثاني أكبر صحراء في العالم، وذلك لشاسعتها، حيث تقارب مساحتها 2 مليون متر مربع وتحتوي على تراث طبيعي وثقافي وتاريخي غني ومتنوع. تعد السياحة الصحراوية جوهر المنتوج السياحي الجزائري.

        تحتوي الصحراء على 05 حظائر ثقافية مصنفة، وهي حظيرة الطاسيلي في ولاية ايليزي، الهقار في ولاية تمنراست، وادي ميزاب في ولاية غرداية والحظيرة الثقافية للأطلس الصحراوي في حظيرة توات، قورارة، تيديكلت."
      />
    </div>
  );
};

export default Destination;
